//---------------------------------------------------------------------------
//!
//! @file	main.h
//! @brief	処理メイン
//! @author	Yuki.Ishigaki
//!
//---------------------------------------------------------------------------
#pragma once

namespace mySystem 
{

//---------------------------------------------------------------------------
//! @class メイン処理クラス
//---------------------------------------------------------------------------
class main
{
public:
	//! 初期化
	bool initialize(HINSTANCE& hInstance, HWND& hWnd);
	//! メインループ
	void mainLoop(MSG& msg, HACCEL hAccelTable);

	//! インスタンス取得
	static main* getInstance() {
		static main _myIsntance;
		return &_myIsntance;
	}

private:
	//---- 外部でのインスタンス作成などを禁止し、シングルトン化
	//! コンストラクタ
	main() {}

	//! コピーコンストラクタ
	main(main& main) {}
	//! デストラクタ
	virtual ~main() {}


private:
	// メンバ変数
};

//---------------------------------------------------------------------------
//! アクセスインターフェイス
//---------------------------------------------------------------------------
FORCEINLINE
main* Main()
{
	return main::getInstance();
}

} // namespace mySystem

//---------------------------------------------------------------------------
// END OF FILE
//---------------------------------------------------------------------------